// Запитуємо у користувача ім'я
var userName = prompt("Будь ласка, введіть своє ім'я:");
// Перевіряємо, чи користувач ввів ім'я
if (userName) {    // Виводимо вітання із використанням імені користувача
    alert("Слава Україні, " + userName + "! Ласкаво просимо!");} else {
    // Виводимо повідомлення, якщо ім'я не було введено    alert("Ви не ввели ім'я. Будь ласка, спробуйте ще раз.");
}var userOld = prompt("Введіть свій вік:");
if (userOld) {
    alert( userName+ ", Вам " + userOld );} else {
        alert("Ви не ввели ваш вік. Будь ласка, спробуйте ще раз.");
}